## DataFrame & Series Creation

In [11]:
import pandas as pd
import numpy as np

# Base DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 22],
    'City': ['New York', 'London', 'Paris', 'New York', 'Tokyo'],
    'Salary': [50000, 60000, 55000, 70000, 65000]
}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3', 'row4', 'row5'])
print(df)

         Name  Age      City  Salary
row1    Alice   25  New York   50000
row2      Bob   30    London   60000
row3  Charlie   35     Paris   55000
row4    David   40  New York   70000
row5      Eva   22     Tokyo   65000

In [12]:
# 1. Create a Series from a list: Ek list [10, 20, 30, 40, 50] se ek pandas Series banayein.
pd.Series([10, 20, 30, 40, 50])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [13]:
# 2.  Create a Series with a custom index: Ek list ['a', 'b', 'c', 'd'] ko index ke taur par istemal karke, [100, 200, 300, 400] values ke saath ek Series banayein.
pd.Series([100,200,300,400], index=['a','b','c','d'])

a    100
b    200
c    300
d    400
dtype: int64

In [14]:
# 3. Create a DataFrame from a dictionary: {'Name': ['Aniket', 'Priya', 'Rohan'], 'Age': [28, 24, 22]} dictionary se ek DataFrame banayein.
pd.DataFrame({'Name':['Aniket','Priya','Rohan'],'Age':[28,24,22]})

     Name  Age
0  Aniket   28
1   Priya   24
2   Rohan   22

In [15]:
# 4. Create a DataFrame from a list of lists: Ek list of lists [['Alice', 25], ['Bob', 30], ['Charlie', 35]] se ek DataFrame banayein aur columns ko 'Name' aur 'Age' naam dein.
pd.DataFrame([['Alice',25],['Bob',30],['Charlie',35]], columns=['Name','Age'])

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [16]:
# 5. Create a DataFrame with a specified index: ['row1', 'row2'] ko index ke taur par use karke {'col1': [1, 2], 'col2': [3, 4]} data se ek DataFrame banayein.
pd.DataFrame({'col1':[1,2],'col2':[3,4]}, index=['row1','row2'])

      col1  col2
row1     1     3
row2     2     4

In [17]:
# 6. Create a DataFrame of a specific size: 5 rows aur 3 columns ka ek DataFrame banayein jismein saari values NaN (Not a Number) hon.
pd.DataFrame(np.nan, index=range(5), columns=range(3))

    0   1   2
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
3 NaN NaN NaN
4 NaN NaN NaN

In [18]:
# 7. Create a DataFrame with random numbers: 4 rows aur 4 columns ka ek DataFrame banayein jismein 0 se 100 ke beech random integers hon.
pd.DataFrame(np.random.randint(0,101,size=(4,4)))

    0   1   2   3
0  92  74  89  87
1  55   5  36  46
2  35  84  15  54
3   0  84   9  45

In [19]:
# 8. Create a Series from a dictionary: {'apples': 40, 'bananas': 50, 'cherries': 80} dictionary se ek Series banayein.
pd.Series({'apples':40,'bananas':50,'cherries':80})

apples      40
bananas     50
cherries    80
dtype: int64

In [20]:
# 9. Convert a NumPy array to a DataFrame: Ek 3x3 NumPy array se ek pandas DataFrame banayein.
pd.DataFrame(np.arange(9).reshape(3,3))

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [22]:
# 10. Create a copy of a DataFrame: Pehle banaye gaye kisi bhi DataFrame ki ek copy banayein.
df.copy()

         Name  Age      City  Salary
row1    Alice   25  New York   50000
row2      Bob   30    London   60000
row3  Charlie   35     Paris   55000
row4    David   40  New York   70000
row5      Eva   22     Tokyo   65000